# Core Data Structure

    1) Series - One Dimensional 
    2) Data frame - Two Dimensional

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([71,44,56,33,56,98,56])

In [3]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [4]:
print(s1)

0    71
1    44
2    56
3    33
4    56
5    98
6    56
dtype: int64

In [5]:
s2 = pd.Series([71,44,56], index =["Harry","Shubh","Rohan"])

In [6]:
print(s2)

Harry    71
Shubh    44
Rohan    56
dtype: int64

In [7]:
data = {
"name": ["Alice", "Bob", "Charlie"],
"age": [25, 30, 35],
"city": ["Delhi", "Mumbai", "Bangalore"]
}

In [11]:
pd.DataFrame(data)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
df.columns

Index(['name', 'age', 'city'], dtype='object')